UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d31edcfb-c254-4df6-813c-45d97556c9a4">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>саУНФ_СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДоставки</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>GEOКоординаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="578aaecc-aed2-4ef8-88f9-128a6e803783">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="adb6110c-e022-4572-88ef-65dd4952fcbe">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a66e61d-1e1f-42eb-84c7-96c67491221a">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd18fe57-8dac-4f41-ba14-ab79115be357">
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83abc3c8-5d30-4200-9b3c-c098e93d9dd4">
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="def7c5d9-841f-49c8-a2ab-a11c7b524370">
    <name>НомерТелефонаДляПоиска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_ЛК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6a614d71-f1bf-4633-927f-fd1ab375a540">
    <name>ВидКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbfd1e4e-302d-4158-a36e-7de2ee52275f">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76421bdf-3553-4920-b9b2-b9cca25e740f">
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d913c699-9b21-4f70-9e25-e7cd66899b35">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФИОДиректора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="7bfdd4f5-ffe7-4ecb-b402-405a8f1c112a">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0256d9ee-2e46-491e-949b-274e47734717">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b53e5f38-6df7-47fc-b690-eb2dee6eb3ca">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dcd2476a-e93e-4236-a2fd-6b93ca54afa7">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d59d1b80-7147-4bb8-ace4-61a0365415ad">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="39ac5143-3bca-4b85-8057-40fdbc360b37">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>id_adress</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/CommonModules/КонтактнаяИнформацияУНФ/Module.bsl
&Вместо("ПередЗаписьюНаСервере")
Процедура саУНФ_ПередЗаписьюНаСервере(Форма, ТекущийОбъект)
	Если  ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.Контрагенты")   Тогда
		ТекущийОбъект.КонтактнаяИнформация.Очистить();
		
		Для Каждого ДанныеКИ Из Форма.КонтактнаяИнформация Цикл
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ТекущийОбъект, ДанныеКИ.Значение, ДанныеКИ.Вид, ДанныеКИ.Тип, ДанныеКИ.id_adress);
		КонецЦикла;
		
		
	Иначе
		ПродолжитьВызов(Форма, ТекущийОбъект);
	КонецЕсли; 
	
КонецПроцедуры

&Вместо("ДобавитьРеквизитыФормыКонтактнойИнформации")
Процедура саУНФ_ДобавитьРеквизитыФормыКонтактнойИнформации(Форма, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти)
	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента"  Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		СписокРеквизитовФормы = Форма.ПолучитьРеквизиты();
		
		СоздатьТаблицуКонтактнаяИнформация = Истина;
		СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Истина;
		
		Для Каждого Реквизит Из СписокРеквизитовФормы Цикл
			Если Реквизит.Имя = "КонтактнаяИнформация" Тогда
				СоздатьТаблицуКонтактнаяИнформация = Ложь;
			ИначеЕсли Реквизит.Имя = "СвойстваВидовКонтактнойИнформации" Тогда
				СоздатьТаблицуСвойстваВидовКонтактнойИнформации = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		ОписаниеСтрока = Новый ОписаниеТипов("Строка");
		ОписаниеБулево = Новый ОписаниеТипов("Булево");
		
		
		
		Если СоздатьТаблицуКонтактнаяИнформация Тогда
			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти", ОписаниеБулево));
			
			ИмяТаблицы = "КонтактнаяИнформация";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Представление", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500)), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Комментарий", ОписаниеСтрока, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Значение", ОписаниеСтрока, ИмяТаблицы));
			Если ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти Тогда
				МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИдентификаторСтрокиТабличнойЧасти", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Неотрицательный)), ИмяТаблицы));
			КонецЕсли;
			
			
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("id_adress", Новый ОписаниеТипов("УникальныйИдентификатор"), ИмяТаблицы));
			
			
			
			
			
		КонецЕсли;
		
		Если СоздатьТаблицуСвойстваВидовКонтактнойИнформации Тогда
			
			ИмяТаблицы = "СвойстваВидовКонтактнойИнформации";
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПредставлениеВида", ОписаниеСтрока, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВыводитьВФормеВсегда", ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РазрешитьВводНесколькихЗначений", ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ОбязательноеЗаполнение", ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроверятьКорректность", ОписаниеБулево, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВидРедактирования", ОписаниеСтрока, ИмяТаблицы));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ВидПоляДругое", ОписаниеСтрока, ИмяТаблицы));
			
		КонецЕсли;
		
		Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		КонецЕсли;
	Иначе
		ПродолжитьВызов(Форма, ЕстьКолонкаИдентификаторСтрокиТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры
